In [1]:
import pandas as pd
import numpy as np
import matplotlib.pyplot as plt
%matplotlib inline
import seaborn as sns

df = pd.read_csv('fulfilment_center_info.csv')
df1 = pd.read_csv('meal_info.csv')
df2 = pd.read_csv('test.csv')
df3 = pd.read_csv('train.csv')

In [2]:
## Making Copies of the files
fill = df.copy()
meal = df1.copy()
test = df2.copy()
train = df3.copy()

The goal of this project will be to look at the data set for a meal delivery service and analyze the data to determine. The purpose of picking this project was to bolster join skills.

New Learned Methods
.unstack()

Issues:
Desert spelt wrong

In [3]:
fill.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 77 entries, 0 to 76
Data columns (total 5 columns):
center_id      77 non-null int64
city_code      77 non-null int64
region_code    77 non-null int64
center_type    77 non-null object
op_area        77 non-null float64
dtypes: float64(1), int64(3), object(1)
memory usage: 3.1+ KB

Questions that come to mind, does the operational area determine the number of sales
is it certain areas that are sending more promo than others
which meals are the most popular
which centers have the highest amount of distribution in price
base price vs checkout price
put center id city code region code center type op area into seperate histograms
center id vs check out price, base price, promo, homepage
drop center type
see which centers sell more of which cuisine

In [4]:
fill.head()

   center_id  city_code  region_code center_type  op_area
0         11        679           56      TYPE_A      3.7
1         13        590           56      TYPE_B      6.7
2        124        590           56      TYPE_C      4.0
3         66        648           34      TYPE_A      4.1
4         94        632           34      TYPE_C      3.6

In [5]:
# This line of codes counts the number of centers for each region and their types
fill.groupby(['region_code', 'center_type'])['center_id'].count().unstack()

center_type  TYPE_A  TYPE_B  TYPE_C
region_code
23              1.0     NaN     NaN
34             10.0     5.0     6.0
35              1.0     NaN     NaN
56             17.0     6.0     7.0
71              1.0     NaN     NaN
77             10.0     3.0     4.0
85              2.0     1.0     2.0
93              1.0     NaN     NaN

We can see that region 56 has the bulk of the area with region 34 beind it

In [6]:
meal.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 51 entries, 0 to 50
Data columns (total 3 columns):
meal_id     51 non-null int64
category    51 non-null object
cuisine     51 non-null object
dtypes: int64(1), object(2)
memory usage: 1.3+ KB

In [7]:
meal.head()

   meal_id   category cuisine
0     1885  Beverages    Thai
1     1993  Beverages    Thai
2     2539  Beverages    Thai
3     1248  Beverages  Indian
4     2631  Beverages  Indian

In [8]:
meal.groupby(['category','cuisine'])['meal_id'].count().unstack()

cuisine       Continental  Indian  Italian  Thai
category
Beverages             3.0     3.0      3.0   3.0
Biryani               NaN     3.0      NaN   NaN
Desert                NaN     3.0      NaN   NaN
Extras                NaN     NaN      NaN   3.0
Fish                  3.0     NaN      NaN   NaN
Other Snacks          NaN     NaN      NaN   3.0
Pasta                 NaN     NaN      3.0   NaN
Pizza                 3.0     NaN      NaN   NaN
Rice Bowl             NaN     3.0      NaN   NaN
Salad                 NaN     NaN      3.0   NaN
Sandwich              NaN     NaN      3.0   NaN
Seafood               3.0     NaN      NaN   NaN
Soup                  NaN     NaN      NaN   3.0
Starters              NaN     NaN      NaN   3.0

This shows us the number of meal ids for each cusine

In [9]:
test.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 32573 entries, 0 to 32572
Data columns (total 8 columns):
id                       32573 non-null int64
week                     32573 non-null int64
center_id                32573 non-null int64
meal_id                  32573 non-null int64
checkout_price           32573 non-null float64
base_price               32573 non-null float64
emailer_for_promotion    32573 non-null int64
homepage_featured        32573 non-null int64
dtypes: float64(2), int64(6)
memory usage: 2.0 MB

In [10]:
test.describe()

,id,week,center_id,meal_id,checkout_price,base_price,emailer_for_promotion,homepage_featured
count,3.257300e+04,32573.000000,32573.000000,32573.000000,32573.000000,32573.000000,32573.000000,32573.000000
mean,1.248476e+06,150.477819,81.901728,2032.067909,341.854440,356.493615,0.066435,0.081356
std,1.441580e+05,2.864072,45.950455,547.199004,153.893886,155.150101,0.249045,0.273385
min,1.000085e+06,146.000000,10.000000,1062.000000,67.900000,89.240000,0.000000,0.000000
25%,1.123969e+06,148.000000,43.000000,1558.000000,214.430000,243.500000,0.000000,0.000000
50%,1.247296e+06,150.000000,76.000000,1993.000000,320.130000,321.130000,0.000000,0.000000
75%,1.372971e+06,153.000000,110.000000,2569.000000,446.230000,455.930000,0.000000,0.000000
max,1.499996e+06,155.000000,186.000000,2956.000000,1113.620000,1112.620000,1.000000,1.000000

In [11]:
full = fill.merge(test, left_on = 'center_id', right_on = 'center_id' )
full = full.merge(meal, left_on = 'meal_id', right_on = 'meal_id')
full.head()

,center_id,city_code,region_code,center_type,op_area,id,week,meal_id,checkout_price,base_price,emailer_for_promotion,homepage_featured,category,cuisine
0,11,679,56,TYPE_A,3.7,1098228,146,1885,158.17,157.17,0,0,Beverages,Thai
1,11,679,56,TYPE_A,3.7,1080847,147,1885,158.14,158.14,0,0,Beverages,Thai
2,11,679,56,TYPE_A,3.7,1064602,148,1885,157.17,158.17,0,0,Beverages,Thai
3,11,679,56,TYPE_A,3.7,1093227,149,1885,157.17,158.17,0,0,Beverages,Thai
4,11,679,56,TYPE_A,3.7,1177861,150,1885,159.14,158.14,0,0,Beverages,Thai

univariables

In [12]:
center_count.plot(kind = 'bar', x = 'center_id', y = 'count')

NameError: name 'center_count' is not defined

In [14]:
ttest.groupby(['week', 'emailer_for_promotion'])['checkout_price'].size().unstack()

emailer_for_promotion     0    1
week
146                    3177   63
147                    3117  154
148                    3110  222
149                    2940  373
150                    2815  462
151                    2800  424
152                    3088  154
153                    3110  158
154                    3151   77
155                    3101   77

In [13]:
test.sort_values(by='emailer_for_promotion', ascending=False).head()

,id,week,center_id,meal_id,checkout_price,base_price,emailer_for_promotion,homepage_featured
16286,1287135,150,86,1962,535.50,562.60,1,1
22787,1386804,152,68,1754,195.00,282.27,1,1
10057,1072966,149,32,2304,372.54,434.56,1,1
22958,1062654,153,24,1971,194.97,340.53,1,0
22957,1100299,153,24,1754,195.97,320.16,1,0

In [ ]:
promo = test[test['emailer_for_promotion']== 1]
no_promo = test[test['emailer_for_promotion'] == 0]

In [ ]:
p_describe = promo[['checkout_price']].describe().set_index('checkout_price')

## On average, promo customers spent about $17 more

In [ ]:
week_counts = test.groupby('week')[['id']].count().reset_index().rename(columns = {'id':'count'})
week_counts.plot.line(x='week', y='count');

In [ ]:
week_means = test.groupby('week')[['checkout_price']].mean().reset_index().rename(columns = {'checkout_price':'checkout_price_mean'})
week_means

In [ ]:
test.groupby(['week', 'emailer_for_promotion'])['checkout_price'].aggregate('mean').unstack().plot()

In [ ]:
test.groupby(['week', 'emailer_for_promotion'])['checkout_price'].size().unstack().plot()

In [ ]:
test.groupby(['week', 'emailer_for_promotion'])['checkout_price'].size().unstack()

In [ ]:
test.groupby(['week'])[['checkout_price']].mean().plot()

In [ ]:
plt.figure(figsize=[14,7])
plt.subplot(1,1,1)
sb.plot(data = 'test', x =)

In [ ]:
plt.figure(figsize=[14,7])
plt.subplot(1,1,1)
test.groupby('meal_id')[['checkout_price']].mean().plot(kind = 'bar')

Top meal ids and their total checkout price

Calculate the difference between checkout vs base price
Calculate which weeks centers to the best (line graph?)
See if there is an increase in the number of sales for emailer promotion and homepage feature